<?php

return [//淘车乐配置
    
    //管理员角色对照表
    'user_role_type' =>[

        '超级管理员' => '1',
        '总部管理员' => '2',
        '总部客服'   => '3',
        '总部推广'   => '4',
        '总部财务'   => '5',
        '门店店长'   => '6',
        '门店店员'   => '7',
        '鉴定师'     => '8',
        '评估师'     => '9',
        '保险顾问'   => '10',
        '保险主管'   => '11',
        '贷款主管'   => '12',
        '贷款顾问'   => '13',
    ],

    //车款年份配置
    'year_type' => [
        '2002',
        '2003',
        '2004',
        '2005',
        '2006',
        '2007',
        '2008',
        '2009',
        '2010',
        '2011',
        '2012',
        '2013',
        '2014',
        '2015',
        '2016',
        '2017',
        '2018',
        '2019'
    ],

    //车型类别配置
    'category_type' =>[
        '1' => '轿车',
        '2' => 'SUV',
        '3' => '面包车',
        '4' => '客车',
        '5' => '货车',
        '6' => 'MPV',
    ],

    //变速箱配置
    'gearbox' =>[
        '0' => '不限',
        '1' => '手动',
        '2' => '自动',
        '3' => '手自一体',
    ],

    //外观颜色
    'out_color' =>[
        '0'  => '其它',
        '1'  => '黑',
        '2'  => '白',
        '3'  => '银白',
        '4'  => '红',
        '5'  => '蓝',
        '6'  => '银白',
        '7'  => '橙',
        '8'  => '深灰',
        '8'  => '紫',
        '9'  => '香槟金',
        '10' => '灰',
        '11' => '棕',
        '12' => '绿',
    ],

    //内饰颜色
    'inside_color' =>[
        '1' => '深色',
        '2' => '浅色',
        '3' => '其它',
    ],

    //过户次数(车源添加)
    'sale_number' =>[0, 1, 2, 3, 4, 5],

    //车源类型
    'car_type' =>[
        '1' => '用户自售',
        '2' => '淘车乐自售',
        '3' => '来自车商'
    ],

    //客户来源
    'customer_res' =>[
        '1' => '来电',
        '2' => '进店',
        '3' => '朋友介绍',
        '4' => '车商',
        '5' => '广告',
        '6' => '其它',
    ],

    //保险类别
    'safe_type' =>[
        '1' => '交强险+商业险',     
        '2' => '交强险',  
        '3' => '商业险',    
        '4' => '其它',
    ],

    //排量配置数组
    'capacity' =>[
                    '0'  => '不限',
                    '1'  => '0.8L',
                    '2'  => '1.0L',
                    '3'  => '1.0T',
                    '4'  => '1.2L',
                    '4'  => '1.2T',
                    '23' => '1.3L',
                    '29' => '1.3T',
                    '5'  => '1.4L',
                    '6'  => '1.4T',
                    '7'  => '1.5L',
                    '8'  => '1.5T',
                    '9'  => '1.6L',
                    '10' => '1.6T',
                    '11' => '1.8L',
                    '12' => '1.8T',
                    '13' => '2.0L',
                    '14' => '2.0T',
                    '15' => '2.0L',
                    '26' => '2.2T', 
                    '25' => '2.3L',
                    '16' => '2.4L',
                    '17' => '2.4T',
                    '18' => '2.5L',
                    '27' => '2.7L',
                    '22' => '2.8L',
                    '19' => '3.0L', 
                    '24' => '3.0T',
                    '20' => '3.5L', 
                    '28' => '3.8L',
                    '21' => '4.0L',                                     
                    ],

    //车源状态类别
    'car_stauts' =>[
        '0' => '废弃',
        '1' => '正常',
        '2' => '待跟进',
        '3' => '约车',
        '4' => '交易',
        '5' => '交易完成',
        '6' => '已经匹配',
    ],

    //求购信息状态类别
    'want_stauts' =>[
        '0' => '废弃',
        '1' => '正常',
        '2' => '待跟进',
        '3' => '约车',
        '4' => '交易',
        '5' => '交易完成',
        '6' => '已经匹配',
    ],

    //行驶里程
    'mileage' =>[
        '1' => '无要求',
        '2' => '0-2万公里',
        '3' => '2-5万公里',
        '4' => '5-10万公里',
        '5' => '10万公里以上',
    ],

    //过户次数(求购信息添加)
    'want_sale_number' =>[
        '1' => '无要求',
        '2' => '1次',
        '3' => '2-3次',
        '4' => '3次以上',
    ],

    //销售机会状态
    'chance_status' =>[
        '0' => '废弃',
        '1' => '正常',
        '2' => '待确认',
        '3' => '已确认',
        '4' => '约车',
        '5' => '交易',
        '6' => '交易完成',
    ],

    //约车管理状态
    'plan_status' =>[
        '0' => '废弃',
        '1' => '正常',
        '2' => '交易',
    ],

    //交易状态
    'transcation_status' =>[
        '0' => '废弃',
        '1' => '订车确认',
        '2' => '已订车',
        '3' => '车款确认',
        '4' => '已付车款',
        '5' => '已过户',
    ],

    //置顶
    'is_top' =>[
        '0' => '不置顶',
        '1' => '置顶',
    ],

    //推荐
    'recommend' =>[
        '0' => '不推荐',
        '1' => '推荐',
    ],

    //跟踪来源
    'follow_type' =>[
        '1' => '系统',
        '2' => '互动',
    ],

    //车龄
    'age' =>[
        '1' => '不限',
        '2' => '1-3年',
        '3' => '3-5年',
        '4' => '5年以上',
    ],

    //车龄区间上下限数组
    'age_begin_end' =>[
        '1' => '',
        '2' => ['begin'=>'0', 'end'=>'3'],
        '3' => ['begin'=>'3', 'end'=>'5'],
        '4' => ['begin'=>'5', 'end'=>NULL],
    ],

    //价格区间
    'price_interval' =>[
        '1' => '不限',
        '2' => '3万以下',
        '3' => '3-5万',
        '4' => '5-7万',
        '5' => '7-9万',
        '6' => '9-12万',
        '7' => '12-16万',
        '8' => '16-20万',
        '9' => '20万以上',
    ],

    //价格区间上下限数组
    'price_begin_end' =>[
        '1' => '',
        '2' => ['begin'=>'0', 'end'=>'3'],
        '3' => ['begin'=>'3', 'end'=>'5'],
        '4' => ['begin'=>'5', 'end'=>'7'],
        '5' => ['begin'=>'7', 'end'=>'9'],
        '6' => ['begin'=>'9', 'end'=>'12'],
        '7' => ['begin'=>'12', 'end'=>'16'],
        '8' => ['begin'=>'16', 'end'=>'20'],
        '9' => ['begin'=>'20', 'end'=>NULL],
    ],

    //价格区间(手机端首页)
    'price_interval_mobel' =>[
        '10' => '5万以下',
        '11' => '5-10万',
        '12' => '10-15万',
        '13' => '15万以上',
    ],

    //价格区间上下限数组
    'price_begin_end_mobel' =>[
        '10' => ['begin'=>'0', 'end'=>'5'],
        '11' => ['begin'=>'5', 'end'=>'10'],
        '12' => ['begin'=>'10', 'end'=>'15'],
        '13' => ['begin'=>'15', 'end'=>NULL],
    ],

    //贷款渠道
    'loan_channels' =>[
        '1' => '中行',
        '2' => '平安',
        '3' => '美利',
        '4' => '易鑫',
    ],

    //贷款状态   
    'loan_stauts' =>[
        '0' => '废弃',
        '1' => '正常',
        '2' => '完结',
    ],

    //保险来源   
    'insurance_sor' =>[
        '0' => '亲友',
        '1' => '平安',
        '2' => '中行',
    ],

    //保险公司  
    'insurance_company' =>[
        '1' => '其他',
        '2' => 'SYX安华',
        '3' => 'SYX三营',
        '4' => 'SYX平安',
        '5' => '太平',
        '6' => 'LZ富德',
        '7' => '人保三营',
        '8' => 'RC省国',
        '9' => '英大',
    ],
    
];