<?php

return [//淘车乐配置

    //车款年份配置
    'year_type' => [
        '2002',
        '2003',
        '2004',
        '2005',
        '2006',
        '2007',
        '2009',
        '2010',
        '2011',
        '2012',
        '2013',
        '2014',
        '2015',
        '2016',
        '2017',
        '2018',
        '2019'
    ],

    //车型类别配置
    'category_type' =>[

        '1' => '轿车',
        '2' => 'SUV',
        '3' => '面包车',
        '4' => '客车',
        '5' => '货车',
    ],

    //变速箱配置
    'gearbox' =>[

        '1' => '手动',
        '2' => '自动',
        '3' => '手自一体',
    ],

    //外观颜色
    'out_color' =>[
        '0' => '其它',
        '1' => '黑',
        '2' => '白',
        '3' => '银白',
        '4' => '红',
        '5' => '蓝',
        '6' => '银白',
        '7' => '橙',
    ],

    //内饰颜色
    'inside_color' =>[
        '1' => '深色',
        '2' => '浅色',
        '3' => '其它',
    ],

    //过户次数
    'sale_number' =>[0, 1, 2, 3, 4, 5],

    //车源类型
    'car_type' =>[
        '1' => '用户自售',
        '2' => '淘车乐自售',
        '3' => '来自车商'
    ],

    //客户来源
    'customer_res' =>[
        '1' => '来电',
        '2' => '进店',
        '3' => '朋友介绍',
        '4' => '车商',
        '5' => '广告',
        '6' => '其它',
    ],

    //保险类别
    'safe_type' =>[
        '1' => '商业险',
        '2' => '交强险',
        '3' => '其它',
    ],

    //排量配置数组
    'capacity' =>['1.0L','1.0T','1.2L','1.4L','1.6L','1.8L'],
];